IntoYun/firmware/platform/MCU/STM32F4xx/IntoRobot_Firmware_Driver/src/usbd_dfu_if.c
/**
 ******************************************************************************
 * @file    USB_Device/DFU_Standalone/Src/usbd_dfu_flash.c
 * @author  MCD Application Team
 * @version V1.3.2
 * @date    13-November-2015
 * @brief   Memory management layer
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "usbd_dfu_if.h"
#include "stm32f4xx_hal_conf.h"
#include "platform_config.h"
#include "spi_flash.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#ifdef HAS_SERIAL_FLASH
#define FLASH_DESC_STR      "@Internal+SPI Flash   /0x08000000/04*016Ka,01*064Kg,03*128Kg,124*128Ka,512*004Kg"
#else
#define FLASH_DESC_STR      "@Internal Flash   /0x08000000/04*016Ka,01*064Kg,03*128Kg"
#endif
#define FLASH_ERASE_TIME    (uint16_t)50
#define FLASH_PROGRAM_TIME  (uint16_t)50

#define FLASH_MASK 0xFF000000

#define INTERNAL_FLASH_BASE 0x08000000
#define SPI_FLASH_BASE      0x09000000

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static uint32_t GetSector(uint32_t Address);

/* Extern function prototypes ------------------------------------------------*/
uint16_t Flash_If_Init(void);
uint16_t Flash_If_DeInit(void);
uint16_t Flash_If_Erase(uint32_t Add);
uint16_t Flash_If_Write(uint8_t *src, uint8_t *dest, uint32_t Len);
uint8_t *Flash_If_Read(uint8_t *src, uint8_t *dest, uint32_t Len);
uint16_t Flash_If_GetStatus(uint32_t Add, uint8_t Cmd, uint8_t *buffer);


extern void print(char *p);

#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma data_alignment=4
#endif
__ALIGN_BEGIN USBD_DFU_MediaTypeDef USBD_DFU_fops __ALIGN_END = {
    (uint8_t *)FLASH_DESC_STR,
    Flash_If_Init,
    Flash_If_DeInit,
    Flash_If_Erase,
    Flash_If_Write,
    Flash_If_Read,
    Flash_If_GetStatus,
};

static uint16_t Internal_Flash_If_Init(void)
{
    HAL_FLASH_Unlock();
    return 0;
}

static uint16_t Internal_Flash_If_DeInit(void)
{
    /* Lock the internal flash */
    HAL_FLASH_Lock();
    HAL_NVIC_SystemReset();  //下载完毕后 重启
    return 0;
}

static uint16_t Internal_Flash_If_Erase(uint32_t Add)
{
    uint32_t startsector = 0;
    uint32_t sectornb = 0;
    /* Variable contains Flash operation status */
    HAL_StatusTypeDef status;
    FLASH_EraseInitTypeDef eraseinitstruct;

    /* Get the number of sector */
    startsector = GetSector(Add);

    eraseinitstruct.TypeErase = FLASH_TYPEERASE_SECTORS;
    eraseinitstruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
    eraseinitstruct.Sector = startsector;
    eraseinitstruct.NbSectors = 1;
    status = HAL_FLASHEx_Erase(&eraseinitstruct, &sectornb);

    if (status != HAL_OK) {
        return 1;
    }
    return 0;
}

static uint16_t Internal_Flash_If_Write(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    uint32_t i = 0;

    for(i = 0; i < Len; i+=4)
    {
        if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, (uint32_t)(dest+i), *(uint32_t*)(src+i)) == HAL_OK) {
            if(*(uint32_t *)(src + i) != *(uint32_t*)(dest+i)) {
                return 2;
            }
        } else {
            return 1;
        }
    }
    return 0;
}

static uint8_t *Internal_Flash_If_Read(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    uint32_t i = 0;
    uint8_t *psrc = src;

    for(i = 0; i < Len; i++)
    {
        dest[i] = *psrc++;
    }
    /* Return a valid address to avoid HardFault */
    return (uint8_t*)(dest);
}

#ifdef HAS_SERIAL_FLASH
static uint16_t SPI_If_Init(void)
{
    sFLASH_Init();
    return 0;
}

static uint16_t SPI_If_DeInit(void)
{
    return 0;
}

static uint16_t SPI_If_Erase(uint32_t Add)
{
    sFLASH_EraseSector(Add);
    return 0;
}

static uint16_t SPI_If_Write(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    sFLASH_WriteBuffer(src, (uint32_t)dest, Len);
    return 0;
}

static uint8_t *SPI_If_Read(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    sFLASH_ReadBuffer(dest, (uint32_t)src, Len);
    return (uint8_t*)(dest);
}
#endif

/* Private functions ---------------------------------------------------------*/
/**
 * @brief  Initializes Memory.
 * @param  None
 * @retval 0 if operation is successeful, MAL_FAIL else.
 */
uint16_t Flash_If_Init(void)
{
    Internal_Flash_If_Init();
#ifdef HAS_SERIAL_FLASH
    SPI_If_Init();
#endif
    return 0;
}

/**
 * @brief  De-Initializes Memory.
 * @param  None
 * @retval 0 if operation is successeful, MAL_FAIL else.
 */
uint16_t Flash_If_DeInit(void)
{
    Internal_Flash_If_DeInit();
#ifdef HAS_SERIAL_FLASH
    SPI_If_DeInit();
#endif
    return 0;
}

/**
 * @brief  Erases sector.
 * @param  Add: Address of sector to be erased.
 * @retval 0 if operation is successeful, MAL_FAIL else.
 */
uint16_t Flash_If_Erase(uint32_t Add)
{
    switch (Add & FLASH_MASK)
    {
        case INTERNAL_FLASH_BASE:
            return Internal_Flash_If_Erase(Add);
            break;
#ifdef HAS_SERIAL_FLASH
        case SPI_FLASH_BASE:
            return SPI_If_Erase(Add);
            break;
#endif
        default:
            return 1;
    }
    return 1;
}

/**
 * @brief  Writes Data into Memory.
 * @param  src: Pointer to the source buffer. Address to be written to.
 * @param  dest: Pointer to the destination buffer.
 * @param  Len: Number of data to be written (in bytes).
 * @retval 0 if operation is successeful, MAL_FAIL else.
 */
uint16_t Flash_If_Write(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    switch ((uint32_t)dest & FLASH_MASK)
    {
        case INTERNAL_FLASH_BASE:
            return Internal_Flash_If_Write(src, dest, Len);
            break;
#ifdef HAS_SERIAL_FLASH
        case SPI_FLASH_BASE:
            return SPI_If_Write(src, dest, Len);
            break;
#endif
        default:
            return 1;
    }
    return 1;
}

/**
 * @brief  Reads Data into Memory.
 * @param  src: Pointer to the source buffer. Address to be written to.
 * @param  dest: Pointer to the destination buffer.
 * @param  Len: Number of data to be read (in bytes).
 * @retval Pointer to the physical address where data should be read.
 */
uint8_t *Flash_If_Read(uint8_t *src, uint8_t *dest, uint32_t Len)
{
    switch ((uint32_t)dest & FLASH_MASK)
    {
        case INTERNAL_FLASH_BASE:
            return Internal_Flash_If_Read(src, dest, Len);
            break;
#ifdef HAS_SERIAL_FLASH
        case SPI_FLASH_BASE:
            return SPI_If_Read(src, dest, Len);
            break;
#endif
        default:
            return 0;
    }
    return 0;
}

/**
 * @brief  Gets Memory Status.
 * @param  Add: Address to be read from.
 * @param  Cmd: Number of data to be read (in bytes).
 * @retval 0 if operation is successeful
 */
uint16_t Flash_If_GetStatus(uint32_t Add, uint8_t Cmd, uint8_t *buffer)
{
    switch(Cmd)
    {
        case DFU_MEDIA_PROGRAM:
            buffer[1] = (uint8_t)FLASH_PROGRAM_TIME;
            buffer[2] = (uint8_t)(FLASH_PROGRAM_TIME << 8);
            buffer[3] = 0;
            break;

        case DFU_MEDIA_ERASE:
        default:
            buffer[1] = (uint8_t)FLASH_ERASE_TIME;
            buffer[2] = (uint8_t)(FLASH_ERASE_TIME << 8);
            buffer[3] = 0;
            break;
    }
    return 0;
}

/**
 * @brief  Gets the sector of a given address
 * @param  Address Address of the FLASH Memory
 * @retval The sector of a given address
 */
static uint32_t GetSector(uint32_t Address)
{
    uint32_t sector = 0;

    if((Address < ADDR_FLASH_SECTOR_1) && (Address >= ADDR_FLASH_SECTOR_0))
    {
        sector = FLASH_SECTOR_0;
    }
    else if((Address < ADDR_FLASH_SECTOR_2) && (Address >= ADDR_FLASH_SECTOR_1))
    {
        sector = FLASH_SECTOR_1;
    }
    else if((Address < ADDR_FLASH_SECTOR_3) && (Address >= ADDR_FLASH_SECTOR_2))
    {
        sector = FLASH_SECTOR_2;
    }
    else if((Address < ADDR_FLASH_SECTOR_4) && (Address >= ADDR_FLASH_SECTOR_3))
    {
        sector = FLASH_SECTOR_3;
    }
    else if((Address < ADDR_FLASH_SECTOR_5) && (Address >= ADDR_FLASH_SECTOR_4))
    {
        sector = FLASH_SECTOR_4;
    }
    else if((Address < ADDR_FLASH_SECTOR_6) && (Address >= ADDR_FLASH_SECTOR_5))
    {
        sector = FLASH_SECTOR_5;
    }
    else if((Address < ADDR_FLASH_SECTOR_7) && (Address >= ADDR_FLASH_SECTOR_6))
    {
        sector = FLASH_SECTOR_6;
    }
    else
    {
        sector = FLASH_SECTOR_7;
    }
    return sector;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
